{
	"page1": {},
	"page2": {
		"title_pic": "/pageIntro-title-en.png",
		"title": "Streetscape Search Engine Based on Visual Complexity",
		"text1": "\n            Amidst the trend of digitization and virtulization, physical presence is no longer the exclusive notion of a city, and the very definition of a city is currently undergoing a profound evolution. Nowadays, the virtual world is becoming increasingly intertwined with the physical reality, allowing individuals to explore cities through the internet and digital technologies without the constraints of physical presence. For instance, online street view applications like Google Street View or Baidu Street View serve as effective tools for exploring city images worldwide.\n\nHowever, with the advancement of information infrastructure in smart cities, the desire for the exploration of city images has surged. This includes the rapid retrieval of specific streetscapes, intelligent interaction with urban environments, and informed decision-making for urban planning and development. But these online street view applications still remain constrained by a \"monotonous\" exploration mode, where users are limited to one-way clicks, navigating virtual streets without the opportunity for diverse and interactive urban experiences.\n\nHence, we have introduced an \"Urban Streetscape Search Engine\" application, which systematically collects, analyzes, and characterize the visual information stream of the city streetscapes. Aiming to achieve a dynamic, multi-dimensional, and efficient exploration of urban streetscapes, ultimately revolutionizing the methods of managing and exploring modern urban images.\n",
		"text2": "In this \"Urban Streetscape Search Engine\", we specifically focus on three perception-based visual characteristics: texture, shape, and color of the streetscape, which are quantified using visual complexity as the measurement. There are three compelling reasons behind this approach:",
		"text3": "1. In \"The Image of the City\", Lynch argued that \"it is that shape, color, or arrangement which facilitates the making of vividly identified, powerfully structured, highly useful mental images of the environment ... the mental image involves its shape, color, texture, and detail\" Various visual impressions, such as the brick walls of old houses, lively markets at the doorstep, and boulevards with lush trees, creating vibrant and vivid mental images. These elements: texture, shape, and color, therefore play a significant role in strengthening the imageability and legibility of the city.",
		"text4": "2. In previous research exploring the connection between urban street views and human cognition, it becomes apparent that visual complexity can be seen as the foundational logic and descriptive mechanism underlying various cognitive experiences of streetscapes. Consequently, visual complexity serves as an effective quantitative measure of the amount and intensity of visual perception.",
		"text5": "3. Currently, the digital analysis of streetscapes typically relies on image semantic segmentation, which involves extracting object elements such as the sky, buildings, plants, and roads from the streetscape and quantifying them based on their pixel proportions. However, this method only depicts the object of the streetscape, but fails to capture their impressions. As a result, the visual complexity of streetscape's texture, shape, and color provides a novel perspective for the city image. Simultaneously, it also serves as an effective complement to existing methods, enabling a more comprehensive understanding of the urban streetscape in the digital context.",
		"text6": "To sum up, the visual complexity of texture, shape, and color encapsulates the volume of information in urban visual perception. Building upon this notion, the \"Urban Streetscape Search Engine\" seamlessly merges visual perceptual characteristics, treetscapes, and their geographical information, crafting an intriguing approach to the exploration of city images. Click \"Next page\" to embark on a journey through the city's vibrant visual experiences together! Furthermore, the video on the left provides insights into the application techniques of the \"Urban Streetscape Search Engine\". This application is developed based on the research paper: ",
		"text_paper": "Ma, L., Guo, Z., Lu, M., He, S. & Wang, M. (2023). Developing an urban streetscape indexing based on visual complexity and self-organizing map. Building and Environment, 242, 110549.",
		"text7": "This work was supported by the National Social Science Fund of China (No.21BMZ111), the National Natural Science Foundation of China (No.52308015, No.52208014), the Guangdong Basic and Applied Basic Research Foundation (No.2021A1515110546) , and the Guangzhou Science and Technology Planning Project (No.202102020683). Additionally, we extend our appreciation to Chaoyang Deng, an undergraduate student at Guangdong University of Technology, for his valuable contributions in the preliminary research, GIS data analysis, and data organization work."
	},
	"page3": {}
}